N1 = int(input("Введите номер первого квадрата (от 1 до 9): "))
N2 = int(input("Введите номер второго квадрата (от 1 до 9): "))
N3 = int(input("Введите номер третьего квадрата (от 1 до 9): "))

horizontal = (N1 - 1) // 3 == (N2 - 1) // 3 == (N3 - 1) // 3
vertical = (N1 - 1) % 3 == (N2 - 1) % 3 == (N3 - 1) % 3
diagonal = (N1 == 1 and N2 in [5, 9] and N3 in [7, 3]) or \
           (N1 == 3 and N2 in [5, 7] and N3 == 1) or \
           (N1 == 5 and N2 in [2, 8] and N3 in [1, 9]) or \
           (N1 == 7 and N2 in [4, 5] and N3 in [1, 3]) or \
           (N1 == 9 and N2 in [5, 3] and N3 in [1, 7])

if diagonal:
    print("Квадраты лежат на одной диагонали.")
else:
    print("Квадраты не лежат на одной диагонали.")

if vertical:
    print("Квадраты лежат на одной вертикали.")
else:
    print("Квадраты не лежат на одной вертикали.")

if horizontal:
    print("Квадраты лежат на одной горизонтали.")
else:
    print("Квадраты не лежат на одной горизонтали.")
